# Object creation (2024-01-26)

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.872514 -0.005831 -0.187084  0.154289
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-03 -0.610078  0.447547  1.467199 -0.691568
2013-01-04 -0.334857 -0.815836  0.508883  0.094850
2013-01-05  0.719143  0.028375 -0.658479 -0.689597
2013-01-06  0.126569  1.076629  0.572422  1.914840

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo", #특이한게 ,로 끝내도 되고 아닌 것으로 끝내도 되네?
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
#df2.<TAB> # noqa: E225, E999

#df2.까지 입력후 탭누르라는 의미, vscode에서는 탭안눌러도 자동으로 표시 단 컬럼은 안 표시됨

# Viewing data (2024-01-27)

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.872514 -0.005831 -0.187084  0.154289
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-03 -0.610078  0.447547  1.467199 -0.691568
2013-01-04 -0.334857 -0.815836  0.508883  0.094850
2013-01-05  0.719143  0.028375 -0.658479 -0.689597

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.334857 -0.815836  0.508883  0.094850
2013-01-05  0.719143  0.028375 -0.658479 -0.689597
2013-01-06  0.126569  1.076629  0.572422  1.914840

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[-0.87251379, -0.00583121, -0.18708391,  0.15428871],
       [ 0.4610207 , -1.352952  , -1.07462745,  0.71724429],
       [-0.6100777 ,  0.44754708,  1.4671988 , -0.69156761],
       [-0.33485655, -0.81583559,  0.50888324,  0.09485009],
       [ 0.71914267,  0.02837495, -0.65847894, -0.68959717],
       [ 0.12656871,  1.07662935,  0.57242214,  1.91484023]])

In [13]:
df.values

array([[-0.87251379, -0.00583121, -0.18708391,  0.15428871],
       [ 0.4610207 , -1.352952  , -1.07462745,  0.71724429],
       [-0.6100777 ,  0.44754708,  1.4671988 , -0.69156761],
       [-0.33485655, -0.81583559,  0.50888324,  0.09485009],
       [ 0.71914267,  0.02837495, -0.65847894, -0.68959717],
       [ 0.12656871,  1.07662935,  0.57242214,  1.91484023]])

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.085119 -0.103678  0.104719  0.250010
std    0.624157  0.870843  0.927030  0.979044
min   -0.872514 -1.352952 -1.074627 -0.691568
25%   -0.541272 -0.613334 -0.540630 -0.493485
50%   -0.104144  0.011272  0.160900  0.124569
75%    0.377408  0.342754  0.556537  0.576505
max    0.719143  1.076629  1.467199  1.914840

In [18]:
df.T
#행과 열을 바꿔주는데 미리 계산되어 있음
#메소드가 아닌 속성임

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.872514    0.461021   -0.610078   -0.334857    0.719143    0.126569
B   -0.005831   -1.352952    0.447547   -0.815836    0.028375    1.076629
C   -0.187084   -1.074627    1.467199    0.508883   -0.658479    0.572422
D    0.154289    0.717244   -0.691568    0.094850   -0.689597    1.914840

In [19]:
df.T.index
#값만 바꿔서 나타내는가해서 확인용으로 해줬는데 인덱스도 확실히 바뀌어있다

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.sort_index(axis=1, ascending=False)
#axis = 1 하면 열끼리 정렬하는 것

                   D         C         B         A
2013-01-01  0.154289 -0.187084 -0.005831 -0.872514
2013-01-02  0.717244 -1.074627 -1.352952  0.461021
2013-01-03 -0.691568  1.467199  0.447547 -0.610078
2013-01-04  0.094850  0.508883 -0.815836 -0.334857
2013-01-05 -0.689597 -0.658479  0.028375  0.719143
2013-01-06  1.914840  0.572422  1.076629  0.126569

In [21]:
df.sort_values(by="B")
#df안에 있는 특정 열의 값에 대해서 정렬해줄 수 있음

                   A         B         C         D
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-04 -0.334857 -0.815836  0.508883  0.094850
2013-01-01 -0.872514 -0.005831 -0.187084  0.154289
2013-01-05  0.719143  0.028375 -0.658479 -0.689597
2013-01-03 -0.610078  0.447547  1.467199 -0.691568
2013-01-06  0.126569  1.076629  0.572422  1.914840

# Selection (2024-01-28)

## Getitem ([])

In [22]:
df["A"]

2013-01-01   -0.872514
2013-01-02    0.461021
2013-01-03   -0.610078
2013-01-04   -0.334857
2013-01-05    0.719143
2013-01-06    0.126569
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.872514 -0.005831 -0.187084  0.154289
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-03 -0.610078  0.447547  1.467199 -0.691568

In [24]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-03 -0.610078  0.447547  1.467199 -0.691568
2013-01-04 -0.334857 -0.815836  0.508883  0.094850

## Selection by label

In [25]:
df.loc[dates[0]]

A   -0.872514
B   -0.005831
C   -0.187084
D    0.154289
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
df.loc[dates[0],:]

A   -0.872514
B   -0.005831
C   -0.187084
D    0.154289
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.872514 -0.005831
2013-01-02  0.461021 -1.352952
2013-01-03 -0.610078  0.447547
2013-01-04 -0.334857 -0.815836
2013-01-05  0.719143  0.028375
2013-01-06  0.126569  1.076629

In [28]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02  0.461021 -1.352952
2013-01-03 -0.610078  0.447547
2013-01-04 -0.334857 -0.815836

In [29]:
df.loc["20130102":"20130104",["B","A"]]

                   B         A
2013-01-02 -1.352952  0.461021
2013-01-03  0.447547 -0.610078
2013-01-04 -0.815836 -0.334857

In [30]:
df.loc[dates[0],"A"]

-0.8725137898005322

In [31]:
df.at[dates[0],"A"]

-0.8725137898005322

## Selection by position

In [32]:
df.iloc[3]

A   -0.334857
B   -0.815836
C    0.508883
D    0.094850
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.334857 -0.815836
2013-01-05  0.719143  0.028375

In [34]:
#비교 loc는 슬라이싱 할때 끝부분까지로 인식(끝부분 포함됨) iloc는 끝부분제외
#df.loc[3:5, 0:2] 아 맞다 이런 식으로 숫자 인덱스로 안됬다
df.loc["20130104":"20130105", "A":"B"]

                   A         B
2013-01-04 -0.334857 -0.815836
2013-01-05  0.719143  0.028375

In [35]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.461021 -1.074627
2013-01-03 -0.610078  1.467199
2013-01-05  0.719143 -0.658479

In [36]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-03 -0.610078  0.447547  1.467199 -0.691568

In [37]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.005831 -0.187084
2013-01-02 -1.352952 -1.074627
2013-01-03  0.447547  1.467199
2013-01-04 -0.815836  0.508883
2013-01-05  0.028375 -0.658479
2013-01-06  1.076629  0.572422

In [38]:
df.iloc[1,1]

-1.3529519958979384

In [39]:
df.iat[1,1]

-1.3529519958979384

## Boolean indexing (조건에 따른 컬럼 선택)

In [40]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.461021 -1.352952 -1.074627  0.717244
2013-01-05  0.719143  0.028375 -0.658479 -0.689597
2013-01-06  0.126569  1.076629  0.572422  1.914840

In [41]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.154289
2013-01-02  0.461021       NaN       NaN  0.717244
2013-01-03       NaN  0.447547  1.467199       NaN
2013-01-04       NaN       NaN  0.508883  0.094850
2013-01-05  0.719143  0.028375       NaN       NaN
2013-01-06  0.126569  1.076629  0.572422  1.914840

In [42]:
df2=df.copy()
df2["E"]=["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.872514 -0.005831 -0.187084  0.154289    one
2013-01-02  0.461021 -1.352952 -1.074627  0.717244    one
2013-01-03 -0.610078  0.447547  1.467199 -0.691568    two
2013-01-04 -0.334857 -0.815836  0.508883  0.094850  three
2013-01-05  0.719143  0.028375 -0.658479 -0.689597   four
2013-01-06  0.126569  1.076629  0.572422  1.914840  three

In [43]:
df2[df2["E"].isin(["two", "four"])]
#isin()안에 []로 넣어야하는 듯 (한 개의 경우에도)

                   A         B         C         D     E
2013-01-03 -0.610078  0.447547  1.467199 -0.691568   two
2013-01-05  0.719143  0.028375 -0.658479 -0.689597  four

## Setting

In [44]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df["F"]=s1

In [46]:
df.at[dates[0],"A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.005831 -0.187084  0.154289  NaN
2013-01-02  0.461021 -1.352952 -1.074627  0.717244  1.0
2013-01-03 -0.610078  0.447547  1.467199 -0.691568  2.0
2013-01-04 -0.334857 -0.815836  0.508883  0.094850  3.0
2013-01-05  0.719143  0.028375 -0.658479 -0.689597  4.0
2013-01-06  0.126569  1.076629  0.572422  1.914840  5.0

In [47]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.187084  0.154289  NaN
2013-01-02  0.461021 -1.352952 -1.074627  0.717244  1.0
2013-01-03 -0.610078  0.447547  1.467199 -0.691568  2.0
2013-01-04 -0.334857 -0.815836  0.508883  0.094850  3.0
2013-01-05  0.719143  0.028375 -0.658479 -0.689597  4.0
2013-01-06  0.126569  1.076629  0.572422  1.914840  5.0

In [48]:
len(df)

6

In [49]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.187084  5.0  NaN
2013-01-02  0.461021 -1.352952 -1.074627  5.0  1.0
2013-01-03 -0.610078  0.447547  1.467199  5.0  2.0
2013-01-04 -0.334857 -0.815836  0.508883  5.0  3.0
2013-01-05  0.719143  0.028375 -0.658479  5.0  4.0
2013-01-06  0.126569  1.076629  0.572422  5.0  5.0

In [50]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.187084 -5.0  NaN
2013-01-02 -0.461021 -1.352952 -1.074627 -5.0 -1.0
2013-01-03 -0.610078 -0.447547 -1.467199 -5.0 -2.0
2013-01-04 -0.334857 -0.815836 -0.508883 -5.0 -3.0
2013-01-05 -0.719143 -0.028375 -0.658479 -5.0 -4.0
2013-01-06 -0.126569 -1.076629 -0.572422 -5.0 -5.0

# Missing data (2024-01-29)

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -0.187084  5.0  NaN NaN
2013-01-02  0.461021 -1.352952 -1.074627  5.0  1.0 NaN
2013-01-03 -0.610078  0.447547  1.467199  5.0  2.0 NaN
2013-01-04 -0.334857 -0.815836  0.508883  5.0  3.0 NaN

In [52]:
df1.dropna(how="any") #결측치 있으면 다 제거하는 옵션인듯?

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [53]:
df1.fillna(value=5) #결측치를 특정 값으로 다 바꿔서 채우는 방법

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.187084  5.0  5.0  5.0
2013-01-02  0.461021 -1.352952 -1.074627  5.0  1.0  5.0
2013-01-03 -0.610078  0.447547  1.467199  5.0  2.0  5.0
2013-01-04 -0.334857 -0.815836  0.508883  5.0  3.0  5.0

In [54]:
pd.isna(df1) #결측치가 있는가에 대한 T/F판단 있으면 T

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

# Operations (2024-01-30)

## Stats

In [58]:
df

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.187084  5.0  NaN  1.0
2013-01-02  0.461021 -1.352952 -1.074627  5.0  1.0  1.0
2013-01-03 -0.610078  0.447547  1.467199  5.0  2.0  NaN
2013-01-04 -0.334857 -0.815836  0.508883  5.0  3.0  NaN
2013-01-05  0.719143  0.028375 -0.658479  5.0  4.0  NaN
2013-01-06  0.126569  1.076629  0.572422  5.0  5.0  NaN

In [59]:
df.mean() #NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯

A    0.060300
B   -0.102706
C    0.104719
D    5.000000
F    3.000000
E    1.000000
dtype: float64

자동으로 commit되게 yml추가해준 것 테스트용도

In [57]:
print(df.mean(axis=1)) 
# 마찬가지로 NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯, 단 axis=1이면 행 별로 모든 컬럼의 값의 평균 내줌
# axis = 1말고 그냥 인자로 1만 줘도 동일한 결과가 나오는 듯 함

2013-01-01    1.162583
2013-01-02    0.838907
2013-01-03    1.660934
2013-01-04    1.471638
2013-01-05    1.817808
2013-01-06    2.355124
Freq: D, dtype: float64

In [63]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [64]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Series의 메소드인 shift가 뭐하는 녀석인지 몰라서 문서에 들어가보니 아래와 같이 서술되어있었다   
shift([periods, freq, axis, fill_value, suffix])    
Shift index by desired number of periods with an optional time freq.    
자세한 내용은 모르겠지만 대강 값들을 index를 기준으로 준 값만큼 이동시키는 듯하다   
1일과 2일의 경우 이전 인덱스에 해당하는 데이터가 없으니 NaN로 결측치가 된 것이고    
3,4,5일의 경우 인덱스상으로 2이전의 값들이 존재했으니 해당값들로 바뀌었고   
6일의 경우 인덱스상으로 2이전의 값이 NaN로 결측치 였기에 결측치로 되었는 듯하다.

In [65]:
df.sub(s, axis='index')

                   A         B         C    D    F   E
2013-01-01       NaN       NaN       NaN  NaN  NaN NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN NaN
2013-01-03 -1.610078 -0.552453  0.467199  4.0  1.0 NaN
2013-01-04 -3.334857 -3.815836 -2.491117  2.0  0.0 NaN
2013-01-05 -4.280857 -4.971625 -5.658479  0.0 -1.0 NaN
2013-01-06       NaN       NaN       NaN  NaN  NaN NaN

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame
이번엔 df의 메소드인 sub에 대하여 설명이 없어서 찾아보니 아래와 같이 메소드로 설명되어있었고 잘 이해가 되지 않아 좀더 자세한 독스에 들어갔다    
sub(other[, axis, level, fill_value])       
Get Subtraction of dataframe and other, element-wise (binary operator sub).     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub   
DataFrame.sub(other, axis='columns', level=None, fill_value=None)   
대강 구조를 보니 df에 대하여 빼기를 해주는데 sub()안에 들어있는 값으로 빼주는 것으로 들어올 수 있는 other로는 scalar, sequence, Series, dict or DataFrame이 가능하다고 한다 이중 sequence는 정확히 뭔지 모르겠어서 찾아보니     
https://wikidocs.net/84391      
내용을 참고하였다 대강 리스트, 문자열, 튜플 이 세가지 자료형이라고 생각하면 될듯하다    
그리고 axis에 대하여 0 or index , 1 or columns의 옵션이 있는데 기본값은 colunms로 되어있다  
fill_value는 결측치를 만났을 때 특정값으로 바꿔넣어줄 것인지 선택하는 옵션으로 기본값은 none로 되어있다     
level 옵션에 대해서는 잘모르겠다 예제도 한문제 뿐인데 잘 이해가 되지 않는다 대강 멀티인덱스를 사용할 경우에 사용하는 느낌인데 예제를 아래 그대로 가져와서 해보고 이해해보도록 하겠다

### level 예제

In [66]:
level_example_df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
level_example_df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [67]:
level_example_df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
level_example_df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [72]:
print(level_example_df.div(level_example_df_multindex, level=1))
#원래 예제에는 ,fill_value=0으로 결측치 0으로 바꿔주는 옵션이 추가되어있었다
#뭔가 알듯말듯한데 chatGPT를 통해 설명을 들으니 알 것 같았다
#https://chat.openai.com/share/73654015-96b4-4fb3-b6e3-243526afb670

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        NaN      NaN
  pentagon      NaN      NaN
  hexagon       NaN      NaN

## User defined functions

In [79]:
display(df)
print(df.mean(),'\n')
print(df.mean()*5.6)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.187084  5.0  NaN  1.0
2013-01-02  0.461021 -1.352952 -1.074627  5.0  1.0  1.0
2013-01-03 -0.610078  0.447547  1.467199  5.0  2.0  NaN
2013-01-04 -0.334857 -0.815836  0.508883  5.0  3.0  NaN
2013-01-05  0.719143  0.028375 -0.658479  5.0  4.0  NaN
2013-01-06  0.126569  1.076629  0.572422  5.0  5.0  NaN

A    0.060300
B   -0.102706
C    0.104719
D    5.000000
F    3.000000
E    1.000000
dtype: float64

A     0.337678
B    -0.575154
C     0.586426
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [73]:
df.agg(lambda x: np.mean(x)*5.6)

A     0.337678
B    -0.575154
C     0.586426
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [80]:
df*101.2

                    A           B           C      D      F      E
2013-01-01   0.000000    0.000000  -18.932892  506.0    NaN  101.2
2013-01-02  46.655294 -136.918742 -108.752298  506.0  101.2  101.2
2013-01-03 -61.739863   45.291764  148.480518  506.0  202.4    NaN
2013-01-04 -33.887483  -82.562561   51.498984  506.0  303.6    NaN
2013-01-05  72.777238    2.871545  -66.638069  506.0  404.8    NaN
2013-01-06  12.808754  108.954891   57.929121  506.0  506.0    NaN

In [74]:
df.transform(lambda x: x*101.2)

                    A           B           C      D      F      E
2013-01-01   0.000000    0.000000  -18.932892  506.0    NaN  101.2
2013-01-02  46.655294 -136.918742 -108.752298  506.0  101.2  101.2
2013-01-03 -61.739863   45.291764  148.480518  506.0  202.4    NaN
2013-01-04 -33.887483  -82.562561   51.498984  506.0  303.6    NaN
2013-01-05  72.777238    2.871545  -66.638069  506.0  404.8    NaN
2013-01-06  12.808754  108.954891   57.929121  506.0  506.0    NaN

agg는 대강은 알듯한데 transform은 agg와 뭐가 다른지 모르겠다    
추가로 유사한 것에 apply도 있던 것으로 기억하는데 여기는 왜 빠져있고 차이가 뭔지도 궁금하다     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg   
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform   
https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-udf-mutation   
chatGPT에게 차이를 물어본 내용:
https://chat.openai.com/share/654feb01-8d50-481e-8c7a-ca160e1e74a4

## Value Counts

In [81]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    6
1    2
2    4
3    2
4    3
5    3
6    1
7    1
8    0
9    6
dtype: int32

In [82]:
s.value_counts()

6    2
2    2
3    2
1    2
4    1
0    1
Name: count, dtype: int64

## String Methods

In [83]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
print(s)
s.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

pandas.Series:
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Vectorized String Methods:
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods